In [1]:
import pandas as pd
import numpy as np

## 데이터 정제 및 준비

### 1. 누락된 데이터 처리하기

In [2]:
np.nan

nan

In [3]:
type(np.nan)

float

In [4]:
string_data = pd.Series(['abc', 'def',np.nan,'ghi'])
string_data

0    abc
1    def
2    NaN
3    ghi
dtype: object

In [5]:
pd.isnull(string_data)

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

#### 누락된 데이터 골라내기

In [8]:
from numpy import nan as NA

In [36]:
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [37]:
# dropna가 없다면 아래와 같이 삭제
idx = data[data.isnull()].index
data.drop(idx)

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data == NA]

Series([], dtype: float64)

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data.notnull()

In [13]:
data.drop([data.isnull()]

SyntaxError: unexpected EOF while parsing (1925384233.py, line 1)

In [15]:
data = pd.DataFrame([[1.0, 6.5, 3.0], [1.0, NA, NA],
             [NA, NA, NA], [NA, 6.5, 3.0]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna(axis=0, how="any")#행을 삭제하되,그 행에 널이 하나라고 있으면 삭제

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(axis=0, how="all")#행을 삭제하되, 모두가 널인 행만 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[100] = NA
data

   0    1    2    100
0  1.0  6.5  3.0  NaN
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.5  3.0  NaN

In [21]:
#열방향으로 NA값만 가지고 있는 열 삭제
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data.dropna(axis=1, how="any")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [30]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.590778  1.134588  0.305494
1  0.139397 -1.103547  0.620050
2  1.549424  0.874252 -1.125248
3 -1.937737  1.847083 -0.051809
4 -0.237523  1.650586  0.856391
5  0.834630 -0.389907 -1.235192
6  1.483965  0.518852  1.277002

In [31]:
df.iloc[0:4, 1] = NA
df

          0         1         2
0 -0.590778       NaN  0.305494
1  0.139397       NaN  0.620050
2  1.549424       NaN -1.125248
3 -1.937737       NaN -0.051809
4 -0.237523  1.650586  0.856391
5  0.834630 -0.389907 -1.235192
6  1.483965  0.518852  1.277002

In [32]:
df.iloc[0:2,2] = NA
df

          0         1         2
0 -0.590778       NaN       NaN
1  0.139397       NaN       NaN
2  1.549424       NaN -1.125248
3 -1.937737       NaN -0.051809
4 -0.237523  1.650586  0.856391
5  0.834630 -0.389907 -1.235192
6  1.483965  0.518852  1.277002

In [33]:
df.dropna()

          0         1         2
4 -0.237523  1.650586  0.856391
5  0.834630 -0.389907 -1.235192
6  1.483965  0.518852  1.277002

In [35]:
df.dropna(axis=1, thresh=5) # NA값이 제외한 값이 5개라도 있다면 그열은 삭제 하지 않는다.

          0         2
0 -0.590778       NaN
1  0.139397       NaN
2  1.549424 -1.125248
3 -1.937737 -0.051809
4 -0.237523  0.856391
5  0.834630 -1.235192
6  1.483965  1.277002

In [ ]:
df.dropna(axis=1, thresh=6)

#### 결측치 채우기

In [38]:
df

          0         1         2
0 -0.590778       NaN       NaN
1  0.139397       NaN       NaN
2  1.549424       NaN -1.125248
3 -1.937737       NaN -0.051809
4 -0.237523  1.650586  0.856391
5  0.834630 -0.389907 -1.235192
6  1.483965  0.518852  1.277002

In [39]:
df.fillna(0)

          0         1         2
0 -0.590778  0.000000  0.000000
1  0.139397  0.000000  0.000000
2  1.549424  0.000000 -1.125248
3 -1.937737  0.000000 -0.051809
4 -0.237523  1.650586  0.856391
5  0.834630 -0.389907 -1.235192
6  1.483965  0.518852  1.277002

In [40]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.590778  0.500000  0.000000
1  0.139397  0.500000  0.000000
2  1.549424  0.500000 -1.125248
3 -1.937737  0.500000 -0.051809
4 -0.237523  1.650586  0.856391
5  0.834630 -0.389907 -1.235192
6  1.483965  0.518852  1.277002

In [42]:
#drop,fillna이든 inplace = True옵션을 넣어줘야 적용이 가능하다
df.fillna(0,inplace=True)
df

          0         1         2
0 -0.590778  0.000000  0.000000
1  0.139397  0.000000  0.000000
2  1.549424  0.000000 -1.125248
3 -1.937737  0.000000 -0.051809
4 -0.237523  1.650586  0.856391
5  0.834630 -0.389907 -1.235192
6  1.483965  0.518852  1.277002

In [43]:
df= pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.088658  1.023732 -0.360606
1 -0.257863  0.557817  0.744751
2 -0.725001 -0.706545  1.218024
3  0.612446  0.917818 -0.611833
4  1.704586  0.769135 -1.182774
5 -2.091870  0.052799  0.399969

In [44]:
df.iloc[2:, 1] = NA
df

          0         1         2
0 -0.088658  1.023732 -0.360606
1 -0.257863  0.557817  0.744751
2 -0.725001       NaN  1.218024
3  0.612446       NaN -0.611833
4  1.704586       NaN -1.182774
5 -2.091870       NaN  0.399969

In [45]:
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.088658  1.023732 -0.360606
1 -0.257863  0.557817  0.744751
2 -0.725001       NaN  1.218024
3  0.612446       NaN -0.611833
4  1.704586       NaN       NaN
5 -2.091870       NaN       NaN

In [49]:
df.fillna(axis=0,method='ffill') # axis=0 이므로 '행을 따라서~' 채워넣음

          0         1         2
0 -0.088658  1.023732 -0.360606
1 -0.257863  0.557817  0.744751
2 -0.725001  0.557817  1.218024
3  0.612446  0.557817 -0.611833
4  1.704586  0.557817 -0.611833
5 -2.091870  0.557817 -0.611833

In [50]:
df.fillna(axis=1,method='ffill')

          0         1         2
0 -0.088658  1.023732 -0.360606
1 -0.257863  0.557817  0.744751
2 -0.725001 -0.725001  1.218024
3  0.612446  0.612446 -0.611833
4  1.704586  1.704586  1.704586
5 -2.091870 -2.091870 -2.091870

In [51]:
df.fillna(axis=0,method='ffill', limit=2) # 결측치를 2개만 채운다.

          0         1         2
0 -0.088658  1.023732 -0.360606
1 -0.257863  0.557817  0.744751
2 -0.725001  0.557817  1.218024
3  0.612446  0.557817 -0.611833
4  1.704586       NaN -0.611833
5 -2.091870       NaN -0.611833

In [52]:
#결측치를 평균치로 대체하기
m= df.mean().mean()
m

0.29909961797705337

In [53]:
df.fillna(m)

          0         1         2
0 -0.088658  1.023732 -0.360606
1 -0.257863  0.557817  0.744751
2 -0.725001  0.299100  1.218024
3  0.612446  0.299100 -0.611833
4  1.704586  0.299100  0.299100
5 -2.091870  0.299100  0.299100

### 2. 데이터 변형

#### 중복 제거하기

In [54]:
data = pd.DataFrame({"k1" : ["one", "two"] * 3 + ["two"],
              "k2" : [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [55]:
data.duplicated() # 중복검사

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [56]:
data.drop_duplicates() # 중복값을 제거

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [57]:
#열만 집중해서 중복된 값을 지우기
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [58]:
data.drop_duplicates(['k1'], keep = "last") # 중복의 기준점을 어디다 둘것인지 에대한 keep을 써준다.

    k1  k2
4  one   3
6  two   4

In [59]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [60]:
data.drop_duplicates() # 중복되는 닶이 없다.

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [62]:
data.drop_duplicates(['k1', 'k2']) #마지막 행과 5번째 행이 중복이므로 삭제가 되었다.

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

### Workshop-titanic dataset

#### 값 치환하기

In [63]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [65]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [66]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [67]:
data.replace([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [68]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

#### 축 색인 이름 바꾸기

In [71]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
             index = ['Ohio', 'Colorado', 'New York'],
             columns= ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [72]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [74]:
transform = lambda x: x.upper()

data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [75]:
data.rename(index={'Ohio':'INDIANA'})

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [76]:
data.rename(index = str.title)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

#### 데이터 구간 분할

In [77]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [78]:
cats= pd.cut(ages, [18, 25, 35, 60, 100])

In [83]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [84]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [85]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [86]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [87]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels = group_names) # 라벨링을 할수도 있다.

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

#### 특잇값을 찾고 제외하기

In [108]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001973    -0.025300     0.041096    -0.006795
std       1.010042     1.000220     1.034950     0.960468
min      -3.379661    -3.800691    -3.335511    -2.622192
25%      -0.691751    -0.685697    -0.673938    -0.610970
50%      -0.001482    -0.038743     0.009185    -0.006859
75%       0.656214     0.629477     0.726332     0.645467
max       2.832714     3.249089     3.357353     3.204605

In [109]:
data > 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [110]:
(data > 3).any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [111]:
data[(data > 3).any(axis=1)] # 특잇값(outlier)이 있는 행을 찾을 때 불리언 색인

            0         1         2         3
567 -1.816088  0.650567  3.357353 -1.487205
606 -2.726903  0.177642  0.498709  3.204605
617  0.169277  3.249089  1.375553 -1.485346
749  1.911007  0.563246  3.124721  0.197789

In [112]:
data[data>3] = 3 #3이상의 이상치를 3으로 다 맞추었다.

In [113]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001973    -0.025549     0.040614    -0.006999
std       1.010042     0.999434     1.033500     0.959805
min      -3.379661    -3.800691    -3.335511    -2.622192
25%      -0.691751    -0.685697    -0.673938    -0.610970
50%      -0.001482    -0.038743     0.009185    -0.006859
75%       0.656214     0.629477     0.726332     0.645467
max       2.832714     3.000000     3.000000     3.000000

#### 더미 변수 계산하기(one-hot encoding)

In [88]:
df = pd.DataFrame({"fruit" : ["apple", "apple", "pear", "peach", "pear"], "data" : range(5)})
df

   fruit  data
0  apple     0
1  apple     1
2   pear     2
3  peach     3
4   pear     4

In [89]:
pd.get_dummies(df["fruit"])

   apple  peach  pear
0      1      0     0
1      1      0     0
2      0      0     1
3      0      1     0
4      0      0     1

In [90]:
dummies = pd.get_dummies(df["fruit"], prefix="fruit")
dummies # 머신러닝에서 예측을 하는 부분에서 활용이 됨

   fruit_apple  fruit_peach  fruit_pear
0            1            0           0
1            1            0           0
2            0            0           1
3            0            1           0
4            0            0           1

In [92]:
df[['data']].join(dummies) #서로 다른 데이터 프레임을 조인하는 매서드 join

   data  fruit_apple  fruit_peach  fruit_pear
0     0            1            0           0
1     1            1            0           0
2     2            0            0           1
3     3            0            1           0
4     4            0            0           1

### Worksohp